# Forbes Billionaires of 2021

In [4]:
# Import libraries
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

from wordcloud import WordCloud

In [2]:
# Load Data 
data = pd.read_csv('Billionaire.csv')
data.head()

                       Name NetWorth        Country         Source  Rank
0                Jeff Bezos   $177 B  United States         Amazon     1
1                 Elon Musk   $151 B  United States  Tesla, SpaceX     2
2  Bernard Arnault & family   $150 B         France           LVMH     3
3                Bill Gates   $124 B  United States      Microsoft     4
4           Mark Zuckerberg    $97 B  United States       Facebook     5

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2755 entries, 0 to 2754
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      2755 non-null   object
 1   NetWorth  2755 non-null   object
 2   Country   2755 non-null   object
 3   Source    2755 non-null   object
 4   Rank      2755 non-null   int64
dtypes: int64(1), object(4)
memory usage: 107.7+ KB

In [4]:
India = data[data["Country"] == 'India']

In [5]:
top20 = data[:20]
data1 = pd.DataFrame(top20, columns=["Name", "NetWorth"])
data1

                                     Name NetWorth
0                              Jeff Bezos   $177 B
1                               Elon Musk   $151 B
2                Bernard Arnault & family   $150 B
3                              Bill Gates   $124 B
4                         Mark Zuckerberg    $97 B
5                          Warren Buffett    $96 B
6                           Larry Ellison    $93 B
7                              Larry Page  $91.5 B
8                             Sergey Brin    $89 B
9                           Mukesh Ambani  $84.5 B
10                         Amancio Ortega    $77 B
11  Francoise Bettencourt Meyers & family  $73.6 B
12                         Zhong Shanshan  $68.9 B
13                          Steve Ballmer  $68.7 B
14                             Ma Huateng  $65.8 B
15              Carlos Slim Helu & family  $62.8 B
16                           Alice Walton  $61.8 B
17                             Jim Walton  $60.2 B
18                             Rob Walton  $59.5 B
19                      Michael Bloomberg    $59 B